Revit 2026 API

# InstanceVoidCutUtilsIsVoidInstanceCuttingElement Method

---

Indicates if the element is a family instance with unattached voids that can cut other elements.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsVoidInstanceCuttingElement(
	Element element
)
```
```vb
Public Shared Function IsVoidInstanceCuttingElement (
	element As Element
) As Boolean
```
```cpp
public:
static bool IsVoidInstanceCuttingElement(
	Element^ element
)
```
```fsharp
static member IsVoidInstanceCuttingElement :
        element : Element -> bool
```

#### Parameters

element Element
     The cutting family instance

#### Return Value

Boolean Returns true if the element is a family instance with unattached voids that can cut other elements.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A family instance can cut if the family has unattached voids and the family's parameter "Cut with Voids When Loaded" is checked.

#### Reference

InstanceVoidCutUtils Class

Autodesk.Revit.DB Namespace